public/man/man1/hyprctl.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - hyprctl.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - hyprctl.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>hyprctl - Utility for controlling parts of Hyprland from a CLI or a
script</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>hyprctl</strong> [/(opt)flags/] [*command*] [/(opt)args/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>hyprctl</strong> is a utility for controlling some parts of the compositor from
a CLI or a script.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
CONTROL COMMANDS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>dispatch</strong></p>
<blockquote>
<p>Call a dispatcher with an argument.</p>
<p>
An argument must be present. For dispatchers without parameters it can
be anything.</p>
<p>
Returns: <em>ok</em> on success, and an error message on failure.</p>
<dl>
<dt>
Examples:
</dt>
<dd><strong>hyprctl</strong> <em>dispatch exec kitty</em>

<strong>hyprctl</strong> <em>dispatch pseudo x</em></dd>
</dl>
</blockquote>
<p>
<strong>keyword</strong></p>
<blockquote>
<p>Set a config keyword dynamically.</p>
<p>
Returns: <em>ok</em> on success, and an error message on failure.</p>
<dl>
<dt>
Examples:
</dt>
<dd><strong>hyprctl</strong> <em>keyword bind SUPER,0,pseudo</em>

<strong>hyprctl</strong> <em>keyword general:border_size 10</em></dd>
</dl>
</blockquote>
<p>
<strong>reload</strong></p>
<blockquote>
<p>Force a reload of the config file.</p>
</blockquote>
<p>
<strong>kill</strong></p>
<blockquote>
<p>Enter kill mode, where you can kill an app by clicking on it. You can
exit by pressing ESCAPE.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
INFO COMMANDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>version</strong></p>
<blockquote>
<p>Prints the Hyprland version, flags, commit and branch of build.</p>
</blockquote>
<p>
<strong>monitors</strong></p>
<blockquote>
<p>Lists all the outputs with their properties.</p>
</blockquote>
<p>
<strong>workspaces</strong></p>
<blockquote>
<p>Lists all workspaces with their properties.</p>
</blockquote>
<p>
<strong>clients</strong></p>
<blockquote>
<p>Lists all windows with their properties.</p>
</blockquote>
<p>
<strong>devices</strong></p>
<blockquote>
<p>Lists all connected input devices.</p>
</blockquote>
<p>
<strong>activewindow</strong></p>
<blockquote>
<p>Returns the active window name.</p>
</blockquote>
<p>
<strong>layers</strong></p>
<blockquote>
<p>Lists all the layers.</p>
</blockquote>
<p>
<strong>splash</strong></p>
<blockquote>
<p>Returns the current random splash.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
OPTIONS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>–batch</strong></p>
<blockquote>
<p>Specify a batch of commands to execute.</p>
<dl>
<dt>
Example:
</dt>
<dd><strong>hyprctl</strong> <em>–batch &#34;keyword general:border_size 2 ;</em>
keyword general:gaps_out 20&#34;

<em>;</em> separates the commands.</dd>
</dl>
</blockquote>
<p>
<strong>-j</strong></p>
<blockquote>
<p>Outputs information in JSON.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
BUGS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<ul>
<li>Submit bug reports and request features online
at: :: &lt;/<a href="https://github.com/hyprwm/Hyprland/issues/">https://github.com/hyprwm/Hyprland/issues/</a>&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
SEE ALSO
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Sources at: &lt;/<a href="https://github.com/hyprwm/Hyprland/">https://github.com/hyprwm/Hyprland/</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
COPYRIGHT
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>Copyright (c) 2022, vaxerski</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
AUTHORS
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>Vaxerski &lt;/<a href="https://github.com/vaxerski/">https://github.com/vaxerski/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
